## Plan Result (492: ptlsbox_jenkins_agent_identities - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.aks_cluster_admin[0]
  * azurerm_role_assignment.private_dns_zone_contributor




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_cluster_admin[0] will be created
  + resource "azurerm_role_assignment" "aks_cluster_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = "ec404c08-dc02-ae78-ccd4-3ee415c27c4b"
      + principal_id                     = "5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.private_dns_zone_contributor will be created
  + resource "azurerm_role_assignment" "private_dns_zone_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = "01e6c42b-7526-23f8-6194-10c2e88be7b1"
      + principal_id                     = "5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 492: ptlsbox_jenkins_agent_identities - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":111,"Program":"tfcmt","SHA1":"","Target":"492: ptlsbox_jenkins_agent_identities - TerraformPlanApply","Vars":{}} -->